# SetBarIncluded Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..SetBarIncluded Method
RebarInSystem Class See Also
---
Sets if the bar at the desired index is included or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetBarIncluded(
	bool include,
	int barPositionIndex
)
```

Visual Basic
---
```text
Public Sub SetBarIncluded ( _
	include As Boolean, _
	barPositionIndex As Integer _
)
```

Visual C++
---
```text
public:
void SetBarIncluded(
	bool include,
	int barPositionIndex
)
```

# ### Parameters
include
    Type: System..::..Boolean True to include the bar, false to exclude the bar.
barPositionIndex
    Type: System..::..Int32 The bar index.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | For this RebarInSystem element individual bars can't be moved, excluded or included. |

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace